lib_app/app/controllers/libraries_controller.rb

SELECT "libraries".* FROM "libraries"
---
  def index
    @libraries = Library.all

INSERT INTO "libraries" ("name", "floor_count", "floor_area", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Los Gatos Public Library"], ["floor_count", 25], ["floor_area", 2500], ["created_at", "2016-08-16 21:16:34.251326"], ["updated_at", "2016-08-16 21:16:34.251326"]]
---
  def create
    @library = Library.create(library_params)

SELECT  "libraries".* FROM "libraries" WHERE "libraries"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @library = Library.find_by_id(params[:id])

SELECT  "libraries".* FROM "libraries" WHERE "libraries"."id" = $1 LIMIT 1  [["id", 1]]
---
  def edit
    @library = Library.find_by_id(params[:id])

SELECT  "libraries".* FROM "libraries" WHERE "libraries"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "libraries" SET "name" = $1, "updated_at" = $2 WHERE "libraries"."id" = $3  [["name", "LG Public Library"], ["updated_at", "2016-08-16 22:17:03.064802"], ["id", 1]]
---
  def update
    library = Library.find_by_id(params[:id])
    library.update_attributes(library_params)

SELECT  "libraries".* FROM "libraries" WHERE "libraries"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "libraries" WHERE "libraries"."id" = $1  [["id", 1]]
---
  def destroy
    library = Library.find_by_id(params[:id])
    library.destroy